//*******************************************************************************************************************************************************
//***** Пример работы с библиотекой дисплея Nokia 1202  с контроллером STE2007 в среде Arduino IDE, версия драйвера 1.5
//***** Автор шрифтов и функциый jeka_tm http://arduino.ru/forum/proekty/khronograf-izmeritel-skorosti-puli-ot-prostogo-k-slozhnomu?page=5#comment-136147
//***** Все собрал в библиотеку и создал этот пример Gres, взять библиотеку для Arduino можно тут: https://yadi.sk/d/uwlwBOyijDYYR
//***** Все это можно найти на форуме http://arduino.ru/forum , http://arduino.ru/forum/programmirovanie/biblioteka-dlya-lcd-nokia-1100?page=5
//********************************************************************************************************************************************************
//  В библиотеке использован бинарный параметр color,
//  0 - означает пиксель выключен, цвет белый,
//  1 - пиксель включен, цвет черный.
//  В библиотеке присутствует функция Update();, которая обновляет изображение на дисплее выводя данные из буфера, ее необходимо использовать каждый раз,
//  после использования всех функций вывода информации на дисплей. 
//  На первый взгляд, может показаться, что это не удобно и можно модифицировать библиотеку, вставив эту функцию в конец всех функций вывода информации.
//  Так сделано специально, для возможности собрать готовое изображение на экран, состоящее из разных типов данных, строк, символов, изображений,
//  разных шрифтов и т.д. и только потом вывести весь буфер целиком за один раз обновив изображение на дисплее.
//  
//********************************************************************************************************************************************************

#include "lcd1202.h"

//********************************************************************************************************************************************************
//******************************************************** Определение пинов подключения дисплея *********************************************************

LCD1202 lcd(8, 7, 6, 5);  // RST, CS, MOSI, SCK

//********************************************************************************************************************************************************
//******************************************************** Массив с логотипом для вывода *****************************************************************
static const char image_jeka[768] PROGMEM =
{ 0x00, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE,
  0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE,
  0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE,
  0xFE, 0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x8F, 0x0F,
  0x0F, 0x0F, 0x0F, 0x0F, 0x0F, 0x0F, 0x0F, 0x8F, 0x8F, 0x8F, 0x8F, 0x8F,
  0xCF, 0xCF, 0xCF, 0xCF, 0x8F, 0x8F, 0x8F, 0x8F, 0x0F, 0x0F, 0x0F, 0x0F,
  0x0F, 0x0F, 0x0F, 0x0F, 0x0F, 0x8F, 0x8F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0x5F, 0x3F, 0x3F, 0xEF, 0xFF, 0xDF, 0x9F, 0x9F, 0xFF, 0xEF, 0xFF,
  0xFF, 0x1F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x00,
  0x00, 0x00, 0x00, 0x00, 0xFC, 0xFC, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFE, 0x38,
  0x00, 0x00, 0x00, 0x00, 0x00, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0xFF, 0xFF, 0xFF, 0xFB, 0x39, 0x39, 0x39, 0x38, 0x30, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x30, 0x30, 0x30, 0x78, 0xF9, 0xF9, 0xF9,
  0xF0, 0xF7, 0xEF, 0xEF, 0xDF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xC0, 0xBF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFE,
  0xFE, 0xFC, 0xC0, 0x84, 0x0E, 0x0E, 0x1F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F,
  0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x1F, 0x0E,
  0x80, 0xC0, 0xC0, 0xFC, 0xFC, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x06, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x70, 0xF9, 0xF9,
  0xFB, 0xF7, 0xFF, 0xFF, 0xEF, 0x5F, 0x9F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x8E, 0x06, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x06, 0x06, 0x8E, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x65, 0x3F, 0x1F, 0x1F, 0x1F, 0x1F, 0x1F, 0x0F, 0x0F, 0x0F, 0x0F, 0x0F,
  0x0F, 0x0F, 0x0F, 0x0F, 0x0F, 0x0F, 0x0F, 0x1F, 0x1F, 0x1F, 0x1F, 0x1F,
  0x1F, 0x3F, 0x7F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFE, 0xFE,
  0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x7F, 0xFF, 0xFF, 0xFF,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x03, 0x03, 0x03, 0x03, 0x03,
  0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x47, 0xC7, 0xC7, 0xC7, 0xC7, 0xC3,
  0x43, 0xC1, 0xC1, 0x41, 0x40, 0x00, 0x00, 0x40, 0x40, 0x40, 0x40, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x04, 0x04, 0xFE, 0x00, 0x00, 0xFC, 0x12, 0x11, 0x11,
  0x11, 0x12, 0x1C, 0x00, 0x00, 0xFF, 0x10, 0x10, 0x28, 0x44, 0x82, 0x00,
  0x00, 0x00, 0xC2, 0x22, 0x22, 0x22, 0x24, 0xF8, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x08, 0x08, 0xFE, 0x08, 0x08, 0x00, 0x00,
  0x00, 0xFE, 0x04, 0x04, 0x04, 0xF8, 0x04, 0x04, 0x04, 0xF8, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x04, 0x08,
  0x10, 0x10, 0x10, 0x10, 0x08, 0x07, 0x00, 0x00, 0x01, 0x02, 0x04, 0x04,
  0x04, 0x02, 0x01, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x00, 0x00, 0x07,
  0x00, 0x00, 0x03, 0x04, 0x04, 0x04, 0x04, 0x07, 0x00, 0x00, 0x04, 0x04,
  0x04, 0x04, 0x04, 0x04, 0x00, 0x00, 0x00, 0x03, 0x04, 0x04, 0x04, 0x00,
  0x00, 0x07, 0x00, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x07, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

//********************************************************************************************************************************************************
//******************************************************** Массив с логотипом для вывода *****************************************************************
static const char image_gres[768] PROGMEM =
{ 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x83, 0x7D, 0x5D, 0x9B,
  0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0xED, 0xED, 0x13, 0xFF, 0xFF, 0xFF, 0xFF,
  0x01, 0x6D, 0x6D, 0x7D, 0xFF, 0xFF, 0xFF, 0xFF, 0xB3, 0x6D, 0x6D, 0x9B,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x3F,
  0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x03, 0x03, 0x03, 0x03, 0x01, 0x01,
  0x01, 0x01, 0x03, 0x03, 0x03, 0x03, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01,
  0x03, 0x0F, 0x0F, 0x0F, 0x0F, 0x1F, 0x1F, 0x3F, 0x3F, 0x3F, 0x3F, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xCF,
  0xCF, 0x8F, 0x8F, 0x07, 0x07, 0x07, 0x07, 0x0F, 0x0F, 0x0F, 0x0F, 0x08,
  0x3C, 0x3C, 0xFC, 0xFC, 0x0E, 0x0E, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0xBC, 0xBC, 0xFC, 0xFC, 0x7C, 0x7C, 0x0C, 0x0C, 0x04, 0x04, 0x04, 0x04,
  0x04, 0x04, 0x04, 0x0C, 0x0C, 0x08, 0x08, 0x30, 0x30, 0x40, 0x40, 0x81,
  0x81, 0x01, 0x01, 0x0F, 0x0F, 0x4F, 0x4F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x87,
  0x87, 0x03, 0x03, 0x03, 0x03, 0x0F, 0x0F, 0x8C, 0x8C, 0xE4, 0xE4, 0xE4,
  0xFC, 0xFC, 0xFF, 0xFF, 0xFC, 0xFC, 0xF8, 0xF8, 0xF8, 0xF8, 0x1C, 0x1C,
  0x1F, 0x1F, 0xFF, 0xFF, 0xF8, 0xF8, 0xF0, 0xF0, 0xE0, 0xE0, 0x80, 0x80,
  0x07, 0x07, 0x07, 0x00, 0x00, 0x80, 0x80, 0xE0, 0xE0, 0x78, 0x78, 0x1C,
  0x1C, 0x84, 0x84, 0xE3, 0xE3, 0xE0, 0xE0, 0x03, 0x03, 0x7F, 0x7F, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0x1F, 0x1F, 0xCF, 0xCF, 0xEF, 0xEF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0x07, 0x07, 0x3F, 0x3F, 0xFF, 0xFF, 0xEF, 0xEF, 0xDF, 0xDF, 0x3F,
  0x3F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x1F, 0x1F, 0x08, 0x08,
  0x00, 0x00, 0x01, 0x01, 0x07, 0x07, 0x07, 0x07, 0x0F, 0x0F, 0x0F, 0x0F,
  0x0F, 0xCF, 0xCF, 0xC7, 0xC7, 0xE1, 0xE1, 0x30, 0x30, 0x38, 0x38, 0xDF,
  0xDF, 0x17, 0x17, 0xF0, 0xF0, 0xFF, 0xFF, 0x00, 0x00, 0x08, 0x08, 0xCF,
  0x0F, 0x0F, 0x0F, 0x0F, 0x1F, 0x1F, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFE, 0xFE, 0xFE, 0xFE, 0xF3, 0xF3, 0x1D, 0x1D, 0x03, 0x03, 0xE2,
  0xE2, 0x1F, 0x1F, 0x1D, 0x1D, 0x3D, 0x3D, 0x33, 0x33, 0x33, 0x33, 0xE3,
  0xE3, 0xE3, 0xA1, 0xA1, 0x01, 0x01, 0x10, 0x10, 0x20, 0x20, 0xE0, 0xE0,
  0xE0, 0xE0, 0x10, 0x10, 0x10, 0x10, 0xFC, 0xFC, 0xFC, 0xFC, 0xFE, 0xFE,
  0x0F, 0x83, 0x83, 0x7F, 0x7F, 0x01, 0x01, 0x00, 0x00, 0x8E, 0x8E, 0xFF,
  0xFF, 0x70, 0x70, 0x3F, 0x3F, 0xC3, 0xC3, 0xF0, 0xF0, 0xFE, 0xFE, 0xFD,
  0xF1, 0xF1, 0xFC, 0xFC, 0xFE, 0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFE, 0xFE, 0xFE, 0xFE, 0xF9,
  0xF9, 0xC0, 0xC0, 0xC0, 0xC0, 0xF8, 0xF8, 0xF8, 0xF8, 0x8E, 0x8E, 0x03,
  0x01, 0x01, 0x0F, 0x0F, 0xF0, 0xF0, 0xFC, 0xFC, 0x00, 0x00, 0x01, 0x01,
  0x03, 0x03, 0x0C, 0x0C, 0xF8, 0xF8, 0xFF, 0xFF, 0xC3, 0xC3, 0xC1, 0xC1,
  0x00, 0x37, 0x37, 0x3C, 0x3C, 0x8C, 0x8C, 0xC6, 0xC6, 0xF3, 0xF3, 0xF9,
  0xF9, 0xFC, 0xFC, 0xFE, 0xFE, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xF7,
  0xFF, 0xFF, 0xFC, 0xFC, 0xEF, 0xEF, 0xE7, 0xE7, 0xE7, 0xE7, 0xE4, 0xE4,
  0xE7, 0xE7, 0xF3, 0xF3, 0xF3, 0xF3, 0xF0, 0xF0, 0xF8, 0xF8, 0xF8, 0xF8,
  0xFC, 0xFC, 0xFC, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
//****************************************************************************************************************************************

void setup() {
  
//****************************************************************************************************************************************
//******************************************************** Инициализация дисплея *********************************************************

lcd.Inicialize();  //Инициализация дисплея
lcd.Clear_LCD();  //Очистка дисплея

//****************************************************************************************************************************************

}

void loop() {

//******************************************************************************************************************************************
//***** Список всех функций библиотеки, доступных пользователю.
//***** Пример работы каждой функции, с коментариями, приведен ниже.
//******************************************************************************************************************************************
/*
       LCD1202(uint8_t _RES, uint8_t _CS, uint8_t _Data, uint8_t _Clock);                             // Определение пинов подключения дисплея
       void Inicialize();                                                                             //Инициализация дисплея
       void Clear_LCD();                                                                              //Очистка дисплея
       void Update();                                                             					//Обновление экрана, загрузка информации на дисплей из буфера
       void drawPixel(byte x, byte y, boolean color);                                                 //Включение пикселя
       void fillScreen(boolean color);                                                                //Полная заливка дисплея
       void drawChar(byte x, byte y, boolean color, unsigned char c);                                 //Вывод символа
       void print(byte x, byte y, boolean color, char *str);                                     	//Вывод строки
	   void print(byte x, byte y, boolean color, long num);											//Вывод целочисленных цифровых значений int, long, byte
       void print_1607(byte x, byte y, boolean color, char *str);             						//Вывод строки в заданное знакоместо в заданную строку, как в 1602, только тут 1607
       void drawLine(byte x0, byte y0, byte x1, byte y1, boolean color);                              //Рисование линии
       void drawFastVLine(byte x, byte y, byte h, boolean color);                               //Рисование вертикальной линии заданного высоты
       void drawFastHLine(byte x, byte y, byte w, boolean color);                               //Рисование горизонтальной линии заданной длины
       void drawRect(byte x, byte y, byte w, byte h, boolean color);                                  //Рисование прямоуголника
       void drawCircle(byte x0, byte y0, int16_t r, boolean color);                                   //Рисование окружности
       void drawRoundRect(byte x, byte y, byte w, byte h, byte r, boolean color);                     //Рисование скругленного прямоугольника
       void drawTriangle(byte x0, byte y0, byte x1, byte y1, byte x2, byte y2, boolean color);         //Рисование треуголника
       void drawCircleHelper(byte x0, byte y0, byte r, byte cornername, boolean color);                //Рисование дуги
       void fillCircle(byte x0, byte y0, byte r, boolean color);                                        //Рисование круга
       void fillCircleHelper(byte x0, byte y0, byte r, byte cornername, byte delta, boolean color);     //Рисование полукруга
       void fillRect(byte x, byte y, byte w, byte h, boolean color);                                    //Рисование закрашенного прямоугольника
       void fillRoundRect(byte x, byte y, byte w, byte h, byte r, boolean color);         //Рисование закрашенного, скругленного прямоугольника
       void fillTriangle(byte x0, byte y0, byte x1, byte y1, byte x2, byte y2, boolean color);            //Рисование закрашенного треугольника
       void drawBitmap(byte x, byte y, const char *bitmap, byte w, byte h, boolean color);                //Вывод изображения из массива
       void simb16x32(byte x, byte y, boolean color, byte c);                                               //Вывод цыфры размером 16x32 пикселя
       void simb10x16(byte x, byte y, boolean color, byte c);                                             //Вывод цифры размером 10x16 пикселей
*/


//******************************************************************************************************************************************
//******************************************************** Приветствуем пользователя *******************************************************

lcd.print(1, 1, 1,  "     Привет!    ");
lcd.print(1, 10, 1, "  Пример работы ");
lcd.print(1, 20, 1, "с драйвером v1.5");
lcd.print(1, 30, 1, "     дисплея    ");
lcd.print(1, 40, 1, "   Nokia 1202  ");
lcd.print(1, 50, 1, " с контроллером ");
lcd.print(1, 60, 1, "    STE2007      ");
lcd.Update();
delay(10000);
lcd.Clear_LCD();
lcd.print(1, 1, 1,  "Вопросы на форум");
lcd.print(1, 10, 1, "arduino.ru/forum");
lcd.print(1, 20, 1, " Автор шрифтов  ");
lcd.print(1, 30, 1, " и всех функций ");
lcd.print(1, 40, 1, "     Jeka_tm    ");
lcd.print(1, 50, 1, "Драйвер и пример");
lcd.print(1, 60, 1, "  создал Gres  ");
lcd.Update();
delay(10000);
lcd.Clear_LCD();

//******************************************************************************************************************************************
//************************** Выводим текст в заданные строки по заданным знакоместам, как в 1602 *******************************************

lcd.print_1607(0, 0, 1, "Проверка!");  //Печатаем строку "Проверка!" начиная с нулевого знакоместа, в нулевой строке
lcd.print_1607(1, 6, 1, "Готово!!!");  //Печатаем строку "Готово!!!" начиная с первого знакоместа, в шестой, последней строке



//******************************************************************************************************************************************
//************************************************************ Рисуем по пиксельно ********************************************************

for (int i=0; i<=4; i++) //Поморгаем пикселем по координатам в цикле
{
lcd.drawPixel(10, 10, 1); //Включаем пиксель по координатам x и y
lcd.Update();             //Обновляем дисплей(выводим из буфера)
delay(100);               //Перекур
lcd.drawPixel(10, 10, 0); //Включаем пиксель по координатам x и y
lcd.Update();             //Обновляем дисплей(выводим из буфера)
delay(100);               //Перекур
}
lcd.Clear_LCD();          //Очищаем дисплей
for (int i=0; i<=50; i++) //Нарисуем линию по координатам в цикле
{
lcd.drawPixel(i, i, 1);  //Включаем пиксель по координатам x и y
lcd.Update();             //Обновляем дисплей(выводим из буфера)
}
delay(500);             //Перекур
lcd.Clear_LCD();        //Очищаем дисплей
//******************************************************************************************************************************************
//************************************************************ Заливаем весь дисплей *******************************************************

for (int i=0; i<=2; i++) //Поморгаем всеми пикселями по в цикле
{
lcd.fillScreen(1);        //Включаем все пиксели
lcd.Update();             //Обновляем дисплей(выводим из буфера)
delay(500);               //Перекур
lcd.fillScreen(0);        //Выключаем все пиксели
lcd.Update();             //Обновляем дисплей(выводим из буфера)
delay(500);               //Перекур
}
lcd.Clear_LCD();        //Очищаем дисплей
//******************************************************************************************************************************************
//************************************************************ Выводим символ в координаты *************************************************

lcd.drawChar(30, 10, 1, 'Ж'); //Выводим по координатам x, y, черным чветом, символ Ж 
lcd.Update();                 //Обновляем дисплей(выводим из буфера)
delay(1000);                  //Перекур
lcd.Clear_LCD();              //Очищаем дисплей

//******************************************************************************************************************************************
//********************************************************** Выводим по координатам строку *************************************************

lcd.print(3, 22, 1, "Здравствуй МИР!" ); //Выводим по координатам x, y, черным чветом, строку "Здравствуй МИР!" 
lcd.print(9, 36, 1, "Hello WORLD!" );    //Выводим по координатам x, y, черным чветом, строку "Здравствуй МИР!" 
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//******************************************************************************************************************************************
//********************************************************** Выводим по координатам числовое значение *************************************************
int t= 125;
long p= -345;
byte k= 255;

lcd.print(3, 5, 1, "Выводим циферки:" ); //Выводим по координатам x, y, черным чветом, строку "Выводим циферки:" 
lcd.print(9, 15, 1, t);						//Выводим числовое значение типа integer
lcd.print(9, 25, 1, p);						//Выводим числовое значение типа long
lcd.print(9, 35, 1, k);						//Выводим числовое значение типа byte
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//******************************************************************************************************************************************



//********************************************************** Рисуем по координатам линию ***************************************************

lcd.drawLine(10, 10, 45, 45, 1);  //Выводим по координатам x, y, x1, y1, черным цветом линию 
lcd.Update();                     //Обновляем дисплей(выводим из буфера)
delay(1000);                      //Перекур
lcd.Clear_LCD();                  //Очищаем дисплей

//*******************************************************************************************************************************************
//********************************************* Рисуем по координатам вертикальную линию ****************************************************

lcd.drawFastVLine(20, 20, 30, 1);   //Выводим по координатам x, y, вертикальную линию, высотой 30 пикселей, черным цветом
lcd.Update();                       //Обновляем дисплей(выводим из буфера)
delay(1000);                        //Перекур
lcd.Clear_LCD();                    //Очищаем дисплей

//*******************************************************************************************************************************************
//********************************************* Рисуем по координатам горизонтальную линию ****************************************************

lcd.drawFastHLine(20, 20, 30, 1);   //Выводим по координатам x, y, горизонтальную линию, длиной 30 пикселей, черным цветом
lcd.Update();                       //Обновляем дисплей(выводим из буфера)
delay(1000);                        //Перекур
lcd.Clear_LCD();                    //Очищаем дисплей

//*******************************************************************************************************************************************
//******************************************************* Рисуем по координатам прямоуголник ************************************************

lcd.drawRect(10, 10, 40, 30, 1);    //Рисуем прямоугольник по координатам x, y, высота, ширина, цвет
lcd.Update();                       //Обновляем дисплей(выводим из буфера)
delay(1000);                        //Перекур
lcd.Clear_LCD();                    //Очищаем дисплей

//*******************************************************************************************************************************************
//***************************************************** Рисуем по координатам окружность ****************************************************

lcd.drawCircle(30, 30, 20, 1);      //Рисуем окружность с центром по координатам x, y, радиус, цвет
lcd.Update();                       //Обновляем дисплей(выводим из буфера)
delay(1000);                        //Перекур
lcd.Clear_LCD();                    //Очищаем дисплей

//*******************************************************************************************************************************************
//***************************************** Рисуем по координатам скругленный прямоугольник *************************************************

lcd.drawRoundRect(10, 10, 40, 30, 10, 1);     //Рисуем скругленный прямоугольник по координатам x, y, высота, ширина, радиус скругления, цвет
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//*******************************************************************************************************************************************
//***************************************************** Рисуем по координатам треугольник ***************************************************

lcd.drawTriangle(10, 55, 35, 5, 60, 55, 1);   //Рисуем треугольник по координатам вершин x, y, x1, y1, x2, y2, цвет
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//*******************************************************************************************************************************************
//*************************************************************** Рисуем дугу ****************************************************************

lcd.drawCircleHelper(30, 30, 20, 180, 1);      //Рисуем дугу с координат x, y, радиус, угол поворота, цвет
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//*******************************************************************************************************************************************
//*************************************************************** Рисуем круг ***************************************************************

lcd.fillCircle(30, 30, 20, 1);      //Рисуем закрашенную окружность с центром по координатам x, y, радиус, цвет
lcd.Update();                       //Обновляем дисплей(выводим из буфера)
delay(1000);                        //Перекур
lcd.Clear_LCD();                    //Очищаем дисплей

//*******************************************************************************************************************************************
//***************************************************** Рисуем залитую дугу, полукруг *******************************************************

lcd.fillCircleHelper(30, 30, 20, 10, 1, 1);    //Рисуем залитую дугу с координат x, y, радиус, угол поворота, длина дуги, цвет
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//*******************************************************************************************************************************************
//******************************************************* Рисуем закрашенный прямоуголник ***************************************************

lcd.fillRect(10, 10, 40, 30, 1);    //Рисуем закрашенный прямоугольник по координатам x, y, высота, ширина, цвет
lcd.Update();                       //Обновляем дисплей(выводим из буфера)
delay(1000);                        //Перекур
lcd.Clear_LCD();                    //Очищаем дисплей

//*******************************************************************************************************************************************
//******************************************* Рисуем закрашенный, скругленный прямоугольник *************************************************

lcd.fillRoundRect(10, 10, 40, 30, 10, 1);     //Рисуем закрашенный, скругленный прямоугольник по координатам x, y, высота, ширина, радиус скругления, цвет
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//*******************************************************************************************************************************************
//***************************************************** Рисуем заполенный треугольник *******************************************************

lcd.fillTriangle(10, 55, 35, 5, 60, 55, 1);   //Рисуем заполненный треугольник по координатам вершин x, y, x1, y1, x2, y2, цвет
lcd.Update();                                 //Обновляем дисплей(выводим из буфера)
delay(1000);                                  //Перекур
lcd.Clear_LCD();                              //Очищаем дисплей

//*******************************************************************************************************************************************
//********************************************** Выводим изображение из массива image ********************************************************

lcd.drawBitmap(0, 0, image_jeka, 96, 64, 1);   //Выводим картинку в координаты x, y, с размером 96 на 64 пикселя, с цветом 1 (1 - пиксель включен, темный)
lcd.Update();                                 //Обновляем дисплей(выводим картинку из буфера)
delay(3000);                                  //Любуемся картинкой
lcd.Clear_LCD();                              //Очищаем дисплей

lcd.drawBitmap(0, 0, image_gres, 96, 64, 1);   //Выводим картинку в координаты x, y, с размером 96 на 64 пикселя, с цветом 1 (1 - пиксель включен, темный)
lcd.Update();                                 //Обновляем дисплей(выводим картинку из буфера)
delay(3000);                                  //Любуемся картинкой
lcd.Clear_LCD();                              //Очищаем дисплей

//*********************************************************************************************************************************************
//********************************************** Печать символа размером 16х32 пикселя ********************************************************

lcd.simb16x32(1, 25, 1, 8);            //Выводим в координаты x, y, цветом 1, цифру 8, размером 16х32 пикселя
lcd.simb16x32(27, 25, 1, 8);            //Выводим в координаты x, y, цветом 1, цифру 8, размером 16х32 пикселя
lcd.simb16x32(53, 25, 1, 8);            //Выводим в координаты x, y, цветом 1, цифру 8, размером 16х32 пикселя
lcd.simb16x32(79, 25, 1, 8);            //Выводим в координаты x, y, цветом 1, цифру 8, размером 16х32 пикселя
lcd.Update();                             //Обновляем дисплей(выводим картинку из буфера)
delay(3000);                              //Любуемся картинкой
lcd.Clear_LCD();                          //Очищаем дисплей
       
//**********************************************************************************************************************************************
//********************************************** Печать символа размером 10х16 пикселей ********************************************************
for (int i=1; i<=85; )
{
lcd.simb10x16(i, 30, 1, 8);              //Выводим в координаты x, y, цветом 1, цифру 8, размером 10х16 пикселей
i=i+12;
}
lcd.Update();                             //Обновляем дисплей(выводим картинку из буфера)
delay(3000);                              //Любуемся картинкой
lcd.Clear_LCD();                          //Очищаем дисплей
   
//*********************************************************************************************************************************************
 
}

